hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cm/F2838x_ROM/driverlib_cm/udma.h
//###########################################################################
//
// FILE:   udma.h
//
// TITLE:  Driver for the micro-DMA controller.
//
//###########################################################################
// $TI Release:  $
// $Release Date:  $
// $Copyright: $
//###########################################################################

#ifndef UDMA_H
#define UDMA_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C"
{
#endif

//*****************************************************************************
//
//! \addtogroup udma_api
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "debug.h"
#include "interrupt.h"
#include "cpu.h"
#include "inc_cm/hw_ints.h"
#include "inc_cm/hw_memmap.h"
#include "inc_cm/hw_types.h"
#include "inc_cm/hw_udma.h"

//*****************************************************************************
//
// Defines for the API.
//
//*****************************************************************************

//*****************************************************************************
//
// Values that can be passed as channelInt param to UDMA_registerInterrupt() &
// UDMA_registerInterrupt().
//
//*****************************************************************************
#define UDMA_SW_INT                41U
#define UDMA_ERR_INT               42U

//*****************************************************************************
//
// Values that can be passed as channelNum parameter to UDMA_enableChannel(),
// UDMA_disableChannel(), UDMA_isChannelEnabled(), UDMA_changeChannelMapping(),
// UDMA_requestSoftwareTransfer(),  UDMA_enableChannelAttribute(),
// UDMA_disableChannelAttribute(), UDMA_getChannelAttribute() and
// UDMA_setChannelScatterGatherMode().
//
//*****************************************************************************
#define UDMA_CHANNEL_0             0U
#define UDMA_CHANNEL_1             1U
#define UDMA_CHANNEL_2             2U
#define UDMA_CHANNEL_3             3U
#define UDMA_CHANNEL_4             4U
#define UDMA_CHANNEL_5             5U
#define UDMA_CHANNEL_6             6U
#define UDMA_CHANNEL_7             7U
#define UDMA_CHANNEL_8             8U
#define UDMA_CHANNEL_9             9U
#define UDMA_CHANNEL_10            10U
#define UDMA_CHANNEL_11            11U
#define UDMA_CHANNEL_12            12U
#define UDMA_CHANNEL_13            13U
#define UDMA_CHANNEL_14            14U
#define UDMA_CHANNEL_15            15U
#define UDMA_CHANNEL_16            16U
#define UDMA_CHANNEL_17            17U
#define UDMA_CHANNEL_18            18U
#define UDMA_CHANNEL_19            19U
#define UDMA_CHANNEL_20            20U
#define UDMA_CHANNEL_21            21U
#define UDMA_CHANNEL_22            22U
#define UDMA_CHANNEL_23            23U
#define UDMA_CHANNEL_24            24U
#define UDMA_CHANNEL_25            25U
#define UDMA_CHANNEL_26            26U
#define UDMA_CHANNEL_27            27U
#define UDMA_CHANNEL_28            28U
#define UDMA_CHANNEL_29            29U
#define UDMA_CHANNEL_30            30U
#define UDMA_CHANNEL_31            31U

//*****************************************************************************
//
// Values that can be passed as channelNum parameter to UDMA_enableChannel(),
// UDMA_disableChannel(), UDMA_isChannelEnabled(), UDMA_changeChannelMapping(),
// UDMA_requestSoftwareTransfer(),  UDMA_enableChannelAttribute(),
// UDMA_disableChannelAttribute(), UDMA_getChannelAttribute() and
// UDMA_setChannelScatterGatherMode(). These channel numbers are defined as
// per the primary peripheral assignment for the channel to enhance
// readability.
//
//****************************************************************************
#define UDMA_CHANNEL_USBEP1_RX     UDMA_CHANNEL_0
#define UDMA_CHANNEL_USBEP1_TX     UDMA_CHANNEL_1
#define UDMA_CHANNEL_USBEP2_RX     UDMA_CHANNEL_2
#define UDMA_CHANNEL_USBEP2_TX     UDMA_CHANNEL_3
#define UDMA_CHANNEL_USBEP3_RX     UDMA_CHANNEL_4
#define UDMA_CHANNEL_USBEP3_TX     UDMA_CHANNEL_5
#define UDMA_CHANNEL_UART0_RX      UDMA_CHANNEL_8
#define UDMA_CHANNEL_UART0_TX      UDMA_CHANNEL_9
#define UDMA_CHANNEL_SSI0_RX       UDMA_CHANNEL_10
#define UDMA_CHANNEL_SSI0_TX       UDMA_CHANNEL_11
#define UDMA_CHANNEL_SW_CH12       UDMA_CHANNEL_12
#define UDMA_CHANNEL_SW_CH13       UDMA_CHANNEL_13
#define UDMA_CHANNEL_AES_CTXIN     UDMA_CHANNEL_21
#define UDMA_CHANNEL_AES_DIN       UDMA_CHANNEL_22
#define UDMA_CHANNEL_AES_CTXOUT    UDMA_CHANNEL_23
#define UDMA_CHANNEL_AES_DOUT      UDMA_CHANNEL_24
#define UDMA_CHANNEL_SW_CH26       UDMA_CHANNEL_26
#define UDMA_CHANNEL_SW_CH27       UDMA_CHANNEL_27
#define UDMA_CHANNEL_I2C0_RX       UDMA_CHANNEL_28
#define UDMA_CHANNEL_I2C0_TX       UDMA_CHANNEL_29
#define UDMA_CHANNEL_SW_CH30       UDMA_CHANNEL_30

//*****************************************************************************
//
// Values that can be passed to UDMA_changeChannelMapping() as chMapping
// parameter.
//
//*****************************************************************************
#define UDMA_CH_MAPPING_0          0x0U
#define UDMA_CH_MAPPING_1          0x1U

//*****************************************************************************
//
// Flags that can be passed to UDMA_enableChannelAttribute(),
// UDMA_disableChannelAttribute() and returned from UDMA_getChannelAttribute().
//
//*****************************************************************************
#define UDMA_CH_ATTR_USEBURST      0x00000001U //!< uDMA channel responds to
                                               //!< burst requests only
#define UDMA_CH_ATTR_ALTSELECT     0x00000002U //!< uDMA channel is using
                                               //!< alternate control structure
#define UDMA_CH_ATTR_HIGH_PRIORITY 0x00000004U //!< uDMA channel uses high
                                               //!< priority level
#define UDMA_CH_ATTR_REQMASK       0x00000008U //!< uDMA channel is masked
                                               //!< for associated peripheral
#define UDMA_CH_ATTR_ALL           0x0000000FU //!< OR of all the above
                                               //!< attributes

//*****************************************************************************
//
// DMA control modes that can be passed to UDMA_setChannelTransferParams() and
// returned by UDMA_getChannelTransferMode().
//
//*****************************************************************************
#define UDMA_MODE_STOP                 0x00000000U //!< Stop Mode
#define UDMA_MODE_BASIC                0x00000001U //!< Basic Mode
#define UDMA_MODE_AUTO                 0x00000002U //!< Auto-Request Mode
#define UDMA_MODE_PINGPONG             0x00000003U //!< Ping-Pong Mode
#define UDMA_MODE_MEM_SCATTER_GATHER   0x00000004U //!< Mem Scatter-Gather Mode
#define UDMA_MODE_PER_SCATTER_GATHER   0x00000006U //!< Per Scatter-Gather Mode
#define UDMA_MODE_ALT_SELECT           0x00000001U //!< Specifies Alternate
                                                   //!< Scatter-Gather Mode
                                                   //!< when OR'd with either
                                                   //!< of above two attributes

//*****************************************************************************
//
// Channel configuration values that can be passed to
// UDMA_setChannelControlParams().
//
//*****************************************************************************
#define UDMA_DST_INC_8          0x00000000U //!< Dest addr increment of 8-bit
#define UDMA_DST_INC_16         0x40000000U //!< Dest addr increment of 16-bit
#define UDMA_DST_INC_32         0x80000000U //!< Dest addr increment of 32-bit
#define UDMA_DST_INC_NONE       0xc0000000U //!< Dest addr increment of 0-bit
#define UDMA_SRC_INC_8          0x00000000U //!< Src add increment of 8-bit
#define UDMA_SRC_INC_16         0x04000000U //!< Src add increment of 16-bit
#define UDMA_SRC_INC_32         0x08000000U //!< Src add increment of 32-bit
#define UDMA_SRC_INC_NONE       0x0C000000U //!< Src add increment of 0-bit
#define UDMA_SIZE_8             0x00000000U //!< Src & dest Data size is 8-bit
#define UDMA_SIZE_16            0x11000000U //!< Src & dest data size is 16-bit
#define UDMA_SIZE_32            0x22000000U //!< Src & dest data size is 32-bit
#define UDMA_DST_PROT_PRIV      0x00200000U //!< Dest addr access is privileged
#define UDMA_SRC_PROT_PRIV      0x00040000U //!< Src addr access is privileged
#define UDMA_ARB_1              0x00000000U //!< Arbitrate after 1 transfer
#define UDMA_ARB_2              0x00004000U //!< Arbitrate after 2 transfers
#define UDMA_ARB_4              0x00008000U //!< Arbitrate after 4 transfers
#define UDMA_ARB_8              0x0000c000U //!< Arbitrate after 8 transfers
#define UDMA_ARB_16             0x00010000U //!< Arbitrate after 16 transfers
#define UDMA_ARB_32             0x00014000U //!< Arbitrate after 32 transfers
#define UDMA_ARB_64             0x00018000U //!< Arbitrate after 64 transfers
#define UDMA_ARB_128            0x0001c000U //!< Arbitrate after 128 transfers
#define UDMA_ARB_256            0x00020000U //!< Arbitrate after 256 transfers
#define UDMA_ARB_512            0x00024000U //!< Arbitrate after 512 transfers
#define UDMA_ARB_1024           0x00028000U //!< Arbitrate after 1024 transfers
#define UDMA_NEXT_USEBURST      0x00000008U //!< Use burst transfer to complete
                                            //!< last transfer.

//*****************************************************************************
//
// Flags to be OR'd with the channel number to indicate if the primary or
// alternate control structure should be used.
//
//*****************************************************************************
#define UDMA_PRI_SELECT        0x00000000U //!< Use primary control structure
#define UDMA_ALT_SELECT        0x00000020U //!< Use alternate control structure

//*****************************************************************************
//
//! A helper macro for building scatter-gather task table entries.
//!
//! \param transferCount is the count of items to transfer for this task.
//! \param itemSize is the bit size of the items to transfer for this task.
//! \param srcIncrement is the bit size increment for source data.
//! \param srcAddr is the starting address of the data to transfer.
//! \param dstIncrement is the bit size increment for destination data.
//! \param dstAddr is the starting address of the destination data.
//! \param arbSize is the arbitration size to use for the transfer task.
//! \param mode is the transfer mode for this task.
//!
//! This macro is intended to be used to help populate a table of uDMA tasks
//! for a scatter-gather transfer.  This macro will calculate the values for
//! the fields of a task structure entry based on the input parameters.
//!
//! There are specific requirements for the values of each parameter.  No
//! checking is done so it is up to the caller to ensure that correct values
//! are used for the parameters.
//!
//! The \e transferCount parameter is the number of items that will be
//! transferred by this task.  It must be in the range 1-1024.
//!
//! The \e itemSize parameter is the bit size of the transfer data.  It
//! must be one of \b UDMA_SIZE_8, \b UDMA_SIZE_16, or \b UDMA_SIZE_32.
//!
//! The \e srcIncrement parameter is the increment size for the source
//! data.  It must be one of \b UDMA_SRC_INC_8, \b UDMA_SRC_INC_16,
//! \b UDMA_SRC_INC_32, or \b UDMA_SRC_INC_NONE.
//!
//! The \e srcAddr parameter is a void pointer to the beginning of the source
//! data.
//!
//! The \e dstIncrement parameter is the increment size for the destination
//! data.  It must be one of \b UDMA_DST_INC_8, \b UDMA_DST_INC_16,
//! \b UDMA_DST_INC_32, or \b UDMA_DST_INC_NONE.
//!
//! The \e dstAddr parameter is a void pointer to the beginning of the
//! location where the data will be transferred.
//!
//! The \e arbSize parameter is the arbitration size for the transfer, and
//! must be one of \b UDMA_ARB_1, \b UDMA_ARB_2, \b UDMA_ARB_4, and so on
//! up to \b UDMA_ARB_1024.  This is used to select the arbitration size in
//! powers of 2, from 1 to 1024.
//!
//! The \e mode parameter is the mode to use for this transfer task.  It
//! must be one of \b UDMA_MODE_BASIC, \b UDMA_MODE_AUTO,
//! \b UDMA_MODE_MEM_SCATTER_GATHER, or \b UDMA_MODE_PER_SCATTER_GATHER.  Note
//! that normally all tasks will be one of the scatter-gather modes while the
//! last task is a task list will be AUTO or BASIC.
//!
//! This macro is intended to be used to initialize individual entries of
//! a structure of UDMA_ControlTable type, like this:
//!
//! \verbatim
//!     UDMA_ControlTable MyTaskList[] =
//!     {
//!         UDMA_TASK_STRUCT_ENTRY(Task1Count, UDMA_SIZE_8,
//!                             UDMA_SRC_INC_8, MySourceBuf,
//!                             UDMA_DST_INC_8, MyDestBuf,
//!                             UDMA_ARB_8, UDMA_MODE_MEM_SCATTER_GATHER),
//!         UDMA_TASK_STRUCT_ENTRY(Task2Count, ...),
//!     }
//! \endverbatim
//!
//! \return Nothing; this is not a function.
//
//*****************************************************************************
#define UDMA_TASK_STRUCT_ENTRY(transferCount,                             \
                               itemSize,                                  \
                               srcIncrement,                              \
                               srcAddr,                                   \
                               dstIncrement,                              \
                               dstAddr,                                   \
                               arbSize,                                   \
                               mode)                                      \
    {                                                                     \
        (((srcIncrement) == UDMA_SRC_INC_NONE) ? (void *)(srcAddr) :      \
            ((void *)(&((uint8_t *)(srcAddr))[((transferCount) <<         \
             ((srcIncrement) >> UDMA_DMACHCTL_SRCINC_S)) - 1]))),         \
        (((dstIncrement) == UDMA_DST_INC_NONE) ? (void *)(dstAddr) :      \
            ((void *)(&((uint8_t *)(dstAddr))[((transferCount) <<         \
             ((dstIncrement) >> UDMA_DMACHCTL_DSTINC_S)) - 1]))),         \
        (srcIncrement) | (dstIncrement) | (itemSize) | (arbSize) |        \
        (((transferCount) - 1) << 4) |                                    \
        ((((mode) == UDMA_MODE_MEM_SCATTER_GATHER) ||                     \
          ((mode) == UDMA_MODE_PER_SCATTER_GATHER)) ?                     \
          (mode) | UDMA_MODE_ALT_SELECT : (mode)), 0                      \
    }

//*****************************************************************************
//
//! A structure that defines an entry in the channel control table.  These
//! fields are used by the uDMA controller and normally it is not necessary for
//! software to directly read or write fields in the table.
//
//*****************************************************************************
typedef struct
{
    volatile void *srcEndAddr; //!< Ending source address of the data transfer.
    volatile void *dstEndAddr; //!< Ending dest address of the data transfer.
    volatile uint32_t chControlAttr; //!< Channel control Attributes.
    volatile uint32_t spare;   //!< Spare space.
} UDMA_ControlTable;

//*****************************************************************************
//
// API Function prototypes
//
//*****************************************************************************
//*****************************************************************************
//
//! \internal
//! Checks uDMA base address.
//!
//! \param base is the base address of the uDMA instance used.
//!
//! This function determines if uDMA module base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static inline bool
UDMA_isBaseValid(uint32_t base)
{
    return(base == UDMA_BASE);
}
#endif

//*****************************************************************************
//
//! Enables the uDMA controller for use.
//!
//! \param base is the base address of the uDMA instance used.
//!
//! This function enables the uDMA controller.  The uDMA controller must be
//! enabled before it can be configured and used.
//!
//! \return None.
//
//*****************************************************************************
static inline void
UDMA_enable(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(UDMA_isBaseValid(base));

    //
    // Set the master enable bit in the config register.
    //
    HWREG(base + UDMA_O_DMACFG) |= UDMA_DMACFG_MASTEN;
}

//*****************************************************************************
//
//! Disables the uDMA controller for use.
//!
//! \param base is the base address of the uDMA instance used.
//!
//! This function disables the uDMA controller.  Once disabled, the uDMA
//! controller cannot operate until re-enabled with UDMA_enable().
//!
//! \return None.
//
//*****************************************************************************
static inline void
UDMA_disable(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(UDMA_isBaseValid(base));

    //
    // Clear the master enable bit in the config register.
    //
    HWREG(base + UDMA_O_DMACFG) &= ~UDMA_DMACFG_MASTEN;
}

//*****************************************************************************
//
//! Gets the uDMA error status.
//!
//! \param base is the base address of the uDMA instance used.
//!
//! This function returns the uDMA error status.  It should be called from
//! within the uDMA error interrupt handler to determine if a uDMA error
//! occurred.
//!
//! \return Returns non-zero if a uDMA error is pending.
//
//*****************************************************************************
static inline uint32_t
UDMA_getErrorStatus(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(UDMA_isBaseValid(base));

    //
    // Return the uDMA error status.
    //
    return(HWREG(base + UDMA_O_DMAERRCLR));
}

//*****************************************************************************
//
//! Clears the uDMA error interrupt.
//!
//! \param base is the base address of the uDMA instance used.
//!
//! This function clears a pending uDMA error interrupt.  This function should
//! be called from within the uDMA error interrupt handler to clear the
//! interrupt.
//!
//! \return None.
//
//*****************************************************************************
static inline void
UDMA_clearErrorStatus(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(UDMA_isBaseValid(base));

    //
    // Clear the uDMA error interrupt.
    //
    HWREG(base + UDMA_O_DMAERRCLR) |= UDMA_DMAERRCLR_ERRCLR;
}

//*****************************************************************************
//
//! Enables a uDMA channel for operation.
//!
//! \param base is the base address of the uDMA instance used.
//! \param channelNum is the channel number to enable.
//!
//! This function enables a specific uDMA channel for use.  This function must
//! be used to enable a channel before it can be used to perform a uDMA
//! transfer.
//!
//! When a uDMA transfer is completed, the channel is automatically disabled by
//! the uDMA controller.  Therefore, this function should be called prior to
//! starting up any new transfer.
//!
//! \return None.
//
//*****************************************************************************
static inline void
UDMA_enableChannel(uint32_t base, uint32_t channelNum)
{
    //
    // Check the arguments.
    //
    ASSERT(UDMA_isBaseValid(base));
    ASSERT(channelNum < 32U);

    //
    // Set the bit for this channel in the enable set register.
    //
    HWREG(base + UDMA_O_DMAENASET) = 1U << (channelNum & 0x1FU);
}

//*****************************************************************************
//
//! Disables a uDMA channel for operation.
//!
//! \param base is the base address of the uDMA instance used.
//! \param channelNum is the channel number to disable.
//!
//! This function disables a specific uDMA channel.  Once disabled, a channel
//! cannot respond to uDMA transfer requests until re-enabled via
//! UDMA_enableChannel().
//!
//! \return None.
//
//*****************************************************************************
static inline void
UDMA_disableChannel(uint32_t base, uint32_t channelNum)
{
    //
    // Check the arguments.
    //
    ASSERT(UDMA_isBaseValid(base));
    ASSERT(channelNum < 32U);

    //
    // Set the bit for this channel in the enable clear register.
    //
    HWREG(base + UDMA_O_DMAENACLR) = 1U << (channelNum & 0x1FU);
}

//*****************************************************************************
//
//! Checks if a uDMA channel is enabled for operation.
//!
//! \param base is the base address of the uDMA instance used.
//! \param channelNum is the channel number to check.
//!
//! This function checks to see if a specific uDMA channel is enabled.  This
//! function can be used to check the status of a transfer, as the channel is
//! automatically disabled at the end of a transfer.
//!
//! \return Returns \b true if the channel is enabled, \b false if disabled.
//
//*****************************************************************************
static inline bool
UDMA_isChannelEnabled(uint32_t base, uint32_t channelNum)
{
    //
    // Check the arguments.
    //
    ASSERT(UDMA_isBaseValid(base));
    ASSERT(channelNum < 32U);

    //
    // AND the specified channel bit with the enable register and return the
    // result.
    //
    return((HWREG(base + UDMA_O_DMAENASET) &
            (1U << (channelNum & 0x1FU))) != 0U);
}

//*****************************************************************************
//
//! Sets the base address for the channel control table.
//!
//! \param base is the base address of the uDMA instance used.
//! \param controlTable is a pointer to the 1024-byte-aligned base address
//! of the uDMA channel control table.
//!
//! This function configures the base address of the channel control table.
//! This table resides in system memory and holds control information for each
//! uDMA channel.  The table must be aligned on a 1024-byte boundary.  The base
//! address must be configured before any of the channel functions can be used.
//!
//! The size of the channel control table depends on the number of uDMA
//! channels and the transfer modes that are used.  Refer to the introductory
//! text and the microcontroller datasheet for more information about the
//! channel control table.
//!
//! \return None.
//
//*****************************************************************************
static inline void
UDMA_setControlBase(uint32_t base, const void* controlTable)
{
    //
    // Check the arguments.
    //
    ASSERT(UDMA_isBaseValid(base));
    ASSERT(((uint32_t)controlTable & ~0x3FFU) == (uint32_t)controlTable);
    ASSERT((uint32_t)controlTable >= 0x20000000U);

    //
    // Program the base address into the register.
    //
    HWREG(base + UDMA_O_DMACTLBASE) = (uint32_t)controlTable;
}

