hangcui1201/DSP_TI_TMS320F28379D/F28379D_Projects/libraries/boot_rom/f2838x/rev0/rom_sources/cm/F2838x_ROM/driverlib_cm/udma.h
//*****************************************************************************
//
//! Gets the base address for the channel control table.
//!
//! \param base is the base address of the uDMA instance used.
//!
//! This function gets the base address of the channel control table.  This
//! table resides in system memory and holds control information for each uDMA
//! channel.
//!
//! \return Returns a pointer to the base address of the channel control table.
//
//*****************************************************************************
static inline void*
UDMA_getControlBase(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(UDMA_isBaseValid(base));

    //
    // Read the current value of the control base register and return it to
    // the caller.
    //
    return((void *)HWREG(base + UDMA_O_DMACTLBASE));
}

//*****************************************************************************
//
//! Gets the base address for the channel control table alternate structures.
//!
//! \param base is the base address of the uDMA instance used.
//!
//! This function gets the base address of the second half of the channel
//! control table that holds the alternate control structures for each channel.
//!
//! \return Returns a pointer to the base address of the second half of the
//! channel control table.
//
//*****************************************************************************
static inline void*
UDMA_getAlternateControlBase(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(UDMA_isBaseValid(base));

    //
    // Read the current value of the control base register and return it to
    // the caller.
    //
    return((void *)HWREG(base + UDMA_O_DMAALTBASE));
}

//*****************************************************************************
//
//! Requests a uDMA channel to start a transfer.
//!
//! \param base is the base address of the uDMA instance used.
//! \param channelNum is the channel number on which to request a uDMA
//! transfer.
//!
//! This function allows software to request a uDMA channel to begin a
//! transfer.  This function could be used for performing a memory-to-memory
//! transfer, or if for some reason a transfer needs to be initiated by
//! software instead of the peripheral associated with that channel.
//!
//! \note If the software channel and interrupts are used, then
//! the completion is signaled on the uDMA dedicated interrupt.  If a
//! peripheral channel is used, then the completion is signaled on the
//! peripheral's interrupt.
//!
//! \return None.
//
//*****************************************************************************
static inline void
UDMA_requestSoftwareTransfer(uint32_t base, uint32_t channelNum)
{
    //
    // Check the arguments.
    //
    ASSERT(UDMA_isBaseValid(base));
    ASSERT((channelNum & 0xFFFFU) < 32U);

    //
    // Set the bit for this channel in the software uDMA request register.
    //
    HWREG(base + UDMA_O_DMASWREQ) = 1U << (channelNum & 0x1FU);
}

//*****************************************************************************
//
//! Sets the control parameters for a uDMA channel control structure.
//!
//! \param base is the base address of the uDMA instance used.
//! \param index is the control table structure index.
//! \param chControlAttr specifies the channel control parameters.
//!
//! This function is used to set control parameters for a uDMA transfer. These
//! parameters are typically not changed often.
//!
//! The \e index parameter should be the logical OR of the channel number
//! with one of \b UDMA_PRI_SELECT or \b UDMA_ALT_SELECT to choose whether
//! the primary or alternate data structure is used.
//!
//! The \e chControlAttr parameter is the logical OR of five values: the data
//! size, the source address increment, the destination address increment, the
//! arbitration size, and the use burst flag.  The choices available for each
//! of these values is described below.
//!
//! Choose the data size from one of \b UDMA_SIZE_8, \b UDMA_SIZE_16, or
//! \b UDMA_SIZE_32 to select a data size of 8, 16, or 32 bits.
//!
//! Choose the source address increment from one of \b UDMA_SRC_INC_8,
//! \b UDMA_SRC_INC_16, \b UDMA_SRC_INC_32, or \b UDMA_SRC_INC_NONE to select
//! an address increment of 8-bit bytes, 16-bit half-words, 32-bit words, or
//! to select non-incrementing.
//!
//! Choose the destination address increment from one of \b UDMA_DST_INC_8,
//! \b UDMA_DST_INC_16, \b UDMA_DST_INC_32, or \b UDMA_DST_INC_NONE to select
//! an address increment of 8-bit bytes, 16-bit half-words, 32-bit words, or
//! to select non-incrementing.
//!
//! The arbitration size determines how many items are transferred before
//! the uDMA controller re-arbitrates for the bus.  Choose the arbitration size
//! from one of \b UDMA_ARB_1, \b UDMA_ARB_2, \b UDMA_ARB_4, \b UDMA_ARB_8,
//! through \b UDMA_ARB_1024 to select the arbitration size from 1 to 1024
//! items, in powers of 2.
//!
//! The value \b UDMA_NEXT_USEBURST is used to force the channel to only
//! respond to burst requests at the tail end of a scatter-gather transfer.
//!
//! \note The address increment cannot be smaller than the data size.
//!
//! \return None.
//
//*****************************************************************************
static inline void
UDMA_setChannelControlParams(uint32_t base, uint32_t index,
                             uint32_t chControlAttr)
{
    UDMA_ControlTable *controlTable;

    //
    // Check the arguments.
    //
    ASSERT(UDMA_isBaseValid(base));
    ASSERT((index & 0xFFFFU) < 64U);
    ASSERT(HWREG(base + UDMA_O_DMACTLBASE) != 0U);

    //
    // Get the base address of the control table.
    //
    controlTable = (UDMA_ControlTable *)HWREG(base + UDMA_O_DMACTLBASE);

    //
    // Get the current control word value and mask off the fields to be
    // changed, then OR in the new settings.
    //
    controlTable[index].chControlAttr =
         ((controlTable[index].chControlAttr &
           ~(UDMA_DMACHCTL_DSTINC_M  | UDMA_DMACHCTL_DSTSIZE_M     |
             UDMA_DMACHCTL_SRCINC_M  | UDMA_DMACHCTL_SRCSIZE_M     |
             UDMA_DMACHCTL_ARBSIZE_M | UDMA_DMACHCTL_NXTUSEBURST)) |
             chControlAttr);
}

//*****************************************************************************
//
//! Gets the transfer mode for a uDMA channel control structure.
//!
//! \param base is the base address of the uDMA instance used.
//! \param index is the index for channel control structure.
//!
//! This function is used to get the transfer mode for the uDMA channel and
//! to query the status of a transfer on a channel.  When the transfer is
//! complete the mode is \b UDMA_MODE_STOP.
//!
//! \return Returns the transfer mode of the specified channel and control
//! structure, which is one of the following values:
//! \b UDMA_MODE_STOP,
//! \b UDMA_MODE_BASIC,
//! \b UDMA_MODE_AUTO,
//! \b UDMA_MODE_PINGPONG,
//! \b UDMA_MODE_MEM_SCATTER_GATHER,
//! \b UDMA_MODE_PER_SCATTER_GATHER.
//
//*****************************************************************************
static inline uint32_t
UDMA_getChannelTransferMode(uint32_t base, uint32_t index)
{
    UDMA_ControlTable *controlTable;
    uint32_t chControlAttr;

    //
    // Check the arguments.
    //
    ASSERT(UDMA_isBaseValid(base));
    ASSERT((index & 0xFFFFU) < 64U);
    ASSERT(HWREG(base + UDMA_O_DMACTLBASE) != 0U);

    //
    // Get the base address of the control table.
    //
    controlTable = (UDMA_ControlTable *)HWREG(base + UDMA_O_DMACTLBASE);
    ASSERT(controlTable != 0U);

    //
    // Get the current control word value and mask off all but the mode field.
    //
    chControlAttr = (controlTable[index].chControlAttr &
                     UDMA_DMACHCTL_XFERMODE_M);

    //
    // Check if scatter/gather mode, and if so, mask off the alt bit.
    //
    if(((chControlAttr & ~UDMA_MODE_ALT_SELECT) ==
        UDMA_MODE_MEM_SCATTER_GATHER) ||
       ((chControlAttr & ~UDMA_MODE_ALT_SELECT) ==
        UDMA_MODE_PER_SCATTER_GATHER))
    {
        chControlAttr &= ~UDMA_MODE_ALT_SELECT;
    }

    //
    // Return the mode to the caller.
    //
    return(chControlAttr);
}

//*****************************************************************************
//
//! Configures peripheral mapping for any uDMA channel.
//!
//! \param base is the base address of the uDMA instance used.
//! \param channelNum is the uDMA channel to be assigned.
//! \param chMapping specifies the peripheral assignment for the channel.
//!
//! This function configures peripheral mapping for any uDMA channel. Each uDMA
//! channel can be mapped to a fixed set of peripherals. Refer device datasheet
//! for all the possible configurations for a channel. The param \e channelNum
//! can take values 0U-31U specifying uDMA channels. The param \e chMapping
//! specifies possible peripheral assignmentes for a channel. For selecting
//! primary or secondary channel assignment UDMA_CH_MAPPING_0 or
//! UDMA_CH_MAPPING_1 macros can be used.
//!
//! \note This function is only available on devices that have the DMA Channel
//! Map Select registers (DMACHMAP0-3).  Please consult the data sheet for
//! your part.
//!
//! \return None.
//
//*****************************************************************************
static inline void
UDMA_changeChannelMapping(uint32_t base, uint32_t channelNum,
                          uint32_t chMapping)
{
    uint32_t shift, mapReg;

    //
    // Check the parameters.
    //
    ASSERT(UDMA_isBaseValid(base));
    ASSERT(channelNum <= 31U);
    ASSERT(chMapping & 0xFU);

    //
    // Find the uDMA channel chMapping register and shift value to use for
    // this channel.
    //
    mapReg = base + UDMA_O_DMACHMAP0 + ((channelNum / 8U) * 4U);
    shift = (channelNum & 0x7U) * 4U;

    //
    // Set the channel map encoding for this channel.
    //
    HWREG(mapReg) = (HWREG(mapReg) & ~((uint32_t)0xFU << shift)) |
                    (chMapping << shift);
}

//*****************************************************************************
//
//! Registers an interrupt handler for the uDMA controller.
//!
//! \param channelInt identifies which uDMA interrupt is to be registered.
//! \param fnHandler is a pointer to the function to be called when the
//! interrupt is activated.
//!
//! This function registers and enables the handler to be called when the uDMA
//! controller generates an interrupt. The param \e channelInt can take
//! following values: UDMA_SW_INT or UDMA_ERR_INT.
//!
//! \sa Interrupt_registerHandler() for important information about registering
//! interrupt handlers.
//!
//! \note The interrupt handler for the uDMA is for transfer completion when
//! the software channel is used and for error interrupts.  The interrupts for
//! each peripheral channel are handled through the individual peripheral
//! interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
static inline void
UDMA_registerInterrupt(uint32_t channelInt, void (*fnHandler)(void))
{
    //
    // Check the arguments.
    //
    ASSERT(fnHandler);

    //
    // Register the interrupt handler.
    //
    Interrupt_registerHandler(channelInt, fnHandler);

    //
    // Enable the interrupt.
    //
    Interrupt_enable(channelInt);
}

//*****************************************************************************
//
//! Unregisters an interrupt handler for the uDMA controller.
//!
//! \param channelInt identifies which uDMA interrupt to unregister.
//!
//! This function disables and unregisters the handler to be called for the
//! specified uDMA interrupt. The param \e channelInt can take following
//! values: UDMA_SW_INT or UDMA_ERR_INT.
//!
//! \sa Interrupt_registerHandler() for important information about registering
//! interrupt handlers.
//!
//! \return None.
//
//*****************************************************************************
static inline void
UDMA_unregisterInterrupt(uint32_t channelInt)
{
    //
    // Disable the interrupt.
    //
    Interrupt_disable(channelInt);

    //
    // Unregister the interrupt handler.
    //
    Interrupt_unregisterHandler(channelInt);
}

//*****************************************************************************
//
//! Enables attributes of a uDMA channel.
//!
//! \param base is the base address of the uDMA instance used.
//! \param channelNum is the channel to configure.
//! \param channelAttr is a combination of attributes for the channel.
//!
//! This function is used to enable attributes of a uDMA channel.
//!
//! The \e channelAttr parameter is the logical OR of any of the following:
//!
//! - \b UDMA_CH_ATTR_USEBURST is used to restrict transfers to use only burst
//!   mode.
//! - \b UDMA_CH_ATTR_ALTSELECT is used to select the alternate control structure
//!   for this channel (it is very unlikely that this flag should be used).
//! - \b UDMA_CH_ATTR_HIGH_PRIORITY is used to set this channel to high priority.
//! - \b UDMA_CH_ATTR_REQMASK is used to mask the hardware request signal from the
//!   peripheral for this channel.
//!
//! \return None.
//
//*****************************************************************************
extern void
UDMA_enableChannelAttribute(uint32_t base, uint32_t channelNum,
                            uint32_t channelAttr);

//*****************************************************************************
//
//! Disables attributes of a uDMA channel.
//!
//! \param base is the base address of the uDMA instance used.
//! \param channelNum is the channel to configure.
//! \param channelAttr is a combination of attributes for the channel.
//!
//! This function is used to disable attributes of a uDMA channel.
//!
//! The \e channelAttr parameter is the logical OR of any of the following:
//!
//! - \b UDMA_CH_ATTR_USEBURST is used to restrict transfers to use only burst
//!   mode.
//! - \b UDMA_CH_ATTR_ALTSELECT is used to select the alternate control
//!   structure for this channel.
//! - \b UDMA_CH_ATTR_HIGH_PRIORITY is used to set this channel to high
//!   priority.
//! - \b UDMA_CH_ATTR_REQMASK is used to mask the hardware request signal from
//!   the peripheral for this channel.
//!
//! \return None.
//
//*****************************************************************************
extern void
UDMA_disableChannelAttribute(uint32_t base, uint32_t channelNum,
                             uint32_t channelAttr);

//*****************************************************************************
//
//! Gets the enabled attributes of a uDMA channel.
//!
//! \param base is the base address of the uDMA instance used.
//! \param channelNum is the channel to configure.
//!
//! This function returns a combination of flags representing the attributes of
//! the uDMA channel.
//!
//! \return Returns the logical OR of the attributes of the uDMA channel, which
//! can be any of the following:
//! - \b UDMA_CH_ATTR_USEBURST is used to restrict transfers to use only burst
//!   mode.
//! - \b UDMA_CH_ATTR_ALTSELECT is used to select the alternate control structure
//!   for this channel.
//! - \b UDMA_CH_ATTR_HIGH_PRIORITY is used to set this channel to high priority.
//! - \b UDMA_CH_ATTR_REQMASK is used to mask the hardware request signal from the
//!   peripheral for this channel.
//
//*****************************************************************************
extern uint32_t
UDMA_getChannelAttribute(uint32_t base, uint32_t channelNum);

//*****************************************************************************
//
//! Sets the transfer parameters for a uDMA channel control structure.
//!
//! \param base is the base address of the uDMA instance used.
//! \param index is the index for channel control structure.
//! \param transferMode is the type of uDMA transfer mode.
//! \param srcAddr is the source address for the transfer.
//! \param dstAddr is the destination address for the transfer.
//! \param transferSize is the number of data items to transfer.
//!
//! This function is used to configure the parameters for a uDMA transfer.
//! These parameters are not typically changed often.  The function
//! UDMA_setChannelControlParams() MUST be called at least once for this
//! channel prior to calling this function.
//!
//! The \e index parameter should be the logical OR of the
//! channel number with one of \b UDMA_PRI_SELECT or \b UDMA_ALT_SELECT to
//! choose whether the primary or alternate data structure is used.
//!
//! The \e mode parameter should be one of the following values:
//!
//! - \b UDMA_MODE_STOP stops the uDMA transfer. The controller sets the mode
//!   to this value at the end of a transfer.
//! - \b UDMA_MODE_BASIC to perform a basic transfer based on request.
//! - \b UDMA_MODE_AUTO to perform a transfer that always completes once
//!   started even if the request is removed.
//! - \b UDMA_MODE_PINGPONG to set up a transfer that switches between the
//!   primary and alternate control structures for the channel.  This mode
//!   allows use of ping-pong buffering for uDMA transfers.
//! - \b UDMA_MODE_MEM_SCATTER_GATHER to set up a memory scatter-gather
//!   transfer.
//! - \b UDMA_MODE_PER_SCATTER_GATHER to set up a peripheral scatter-gather
//!   transfer.
//!
//! The \e srcAddr and \e dstAddr parameters are pointers to the first
//! location of the data to be transferred.  These addresses should be aligned
//! according to the item size.  The compiler takes care of this alignment if
//! the pointers are pointing to storage of the appropriate data type.
//!
//! The \e transferSize parameter is the number of data items, not the
//! number of bytes.
//!
//! The two scatter-gather modes, memory and peripheral, are actually different
//! depending on whether the primary or alternate control structure is
//! selected.  This function looks for the \b UDMA_PRI_SELECT and
//! \b UDMA_ALT_SELECT flag along with the channel number and sets the
//! scatter-gather mode as appropriate for the primary or alternate control
//! structure.
//!
//! The channel must also be enabled using UDMA_enableChannel() after calling
//! this function.  The transfer does not begin until the channel has been
//! configured and enabled.  Note that the channel is automatically disabled
//! after the transfer is completed, meaning that UDMA_enableChannel() must
//! be called again after setting up the next transfer.
//!
//! \note Great care must be taken to not modify a channel control structure
//! that is in use or else the results are unpredictable, including the
//! possibility of undesired data transfers to or from memory or peripherals.
//! For BASIC and AUTO modes, it is safe to make changes when the channel is
//! disabled, or the uDMA_getChannelMode() returns \b UDMA_MODE_STOP.  For
//! PINGPONG or one of the SCATTER_GATHER modes, it is safe to modify the
//! primary or alternate control structure only when the other is being used.
//! The uDMA_getChannelMode() function returns \b UDMA_MODE_STOP when a
//! channel control structure is inactive and safe to modify.
//!
//! \return None.
//
//*****************************************************************************
extern void
UDMA_setChannelTransferParams(uint32_t base, uint32_t index, void *srcAddr,
                              void *dstAddr, uint32_t transferMode,
                              uint32_t transferSize);

//*****************************************************************************
//
//! Gets the current transfer size for a uDMA channel control structure.
//!
//! \param base is the base address of the uDMA instance used.
//! \param index is the index for channel control structure.
//!
//! This function is used to get the uDMA transfer size for a channel.  The
//! transfer size is the number of items to transfer, where the size of an item
//! might be 8, 16, or 32 bits.  If a partial transfer has already occurred,
//! then the number of remaining items is returned.  If the transfer is
//! complete, then 0 is returned.
//!
//! \return Returns the number of items remaining to transfer.
//
//*****************************************************************************
extern uint32_t
UDMA_getChannelTransferSize(uint32_t base, uint32_t index);

//*****************************************************************************
//
//! Configures a uDMA channel for scatter-gather mode.
//!
//! \param base is the base address of the uDMA instance used.
//! \param channelNum is the uDMA channel number.
//! \param taskCount is the number of scatter-gather tasks to execute.
//! \param taskList is a pointer to the beginning of the scatter-gather
//! task list.
//! \param isPeriphScatterGather is a flag to indicate it is a peripheral
//! scatter-gather transfer (else it is memory scatter-gather transfer)
//!
//! This function is used to configure a channel for scatter-gather mode.
//! The caller must have already set up a task list and must pass a pointer to
//! the start of the task list as the \e taskList parameter.  The
//! \e taskCount parameter is the count of tasks in the task list, not the
//! size of the task list.  The flag \e bIsPeriphSG should be used to indicate
//! if scatter-gather should be configured for peripheral or memory
//! operation.
//!
//! \sa UDMA_TASK_STRUCT_ENTRY
//!
//! \return None.
//
//*****************************************************************************
extern void
UDMA_setChannelScatterGatherMode(uint32_t base, uint32_t channelNum,
                                uint32_t taskCount, UDMA_ControlTable *taskList,
                                bool isPeriphScatterGather);

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // UDMA_H
